/*
 Navicat Premium Data Transfer

 Source Server         : mac-localhost-mysql
 Source Server Type    : MySQL
 Source Server Version : 80012
 Source Host           : 127.0.0.1:3306
 Source Schema         : finance-manager

 Target Server Type    : MySQL
 Target Server Version : 80012
 File Encoding         : 65001

 Date: 28/07/2020 22:54:26
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for orderlist
-- ----------------------------
DROP TABLE IF EXISTS `orderlist`;
CREATE TABLE `orderlist` (
  `ID` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '项目ID',
  `OrderAccount` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '缴费/收款人',
  `OrderClass` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '班 级',
  `SubjectId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '项 目, 对应subjectlist表ID',
  `TicketTypeId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '票 据, 对应tickettypelist表ID',
  `TicketNo` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '票据号',
  `OrderPrice` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '金 额',
  `PayType` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '收支方式',
  `OrderTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '业务订单时间',
  `OrderDes` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '备 注',
  `ISValid` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否有效',
  `CreateUserId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '创建用户ID',
  `CreateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '创建时间',
  `UpdateUserId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '更新用户ID',
  `UpdateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '更新时间',
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=180 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- ----------------------------
-- Records of orderlist
-- ----------------------------
BEGIN;
INSERT INTO `orderlist` VALUES (1, 'eagle-1', '软件1班', 1, 1, '20200704-1', 5200.00, '微信', '2020-07-01 23:52:38', '学费', 1, 1, '2020-07-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (2, 'eagle-2', '软件2班', 1, 1, '20200704-2', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (3, 'eagle-3', '软件2班', 1, 1, '20200704-3', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (4, 'eagle-4', '软件2班', 1, 1, '20200704-4', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (5, 'eagle-5', '软件2班', 1, 1, '20200704-5', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (6, 'eagle-6', '软件2班', 1, 1, '20200704-6', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (7, 'eagle-7', '软件2班', 1, 1, '20200704-7', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (8, 'eagle-8', '软件2班', 1, 1, '20200704-8', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (9, 'eagle-9', '软件2班', 1, 1, '20200704-9', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (10, 'eagle-10', '软件2班', 1, 1, '20200704-10', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (11, 'eagle-11', '软件2班', 1, 1, '20200704-11', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (12, 'eagle-12', '软件2班', 1, 1, '20200704-12', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (13, 'eagle-13', '软件2班', 1, 1, '20200704-13', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (14, 'eagle-14', '软件2班', 1, 1, '20200704-14', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (15, 'eagle-15', '软件2班', 1, 1, '20200704-15', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (16, 'eagle-16', '软件2班', 1, 1, '20200704-16', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (17, 'eagle-17', '软件2班', 1, 1, '20200704-17', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (18, 'eagle-18', '软件2班', 1, 1, '20200704-18', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (19, 'eagle-19', '软件2班', 1, 1, '20200704-19', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (20, 'eagle-20', '软件2班', 1, 1, '20200704-20', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (21, 'eagle-21', '软件2班', 1, 1, '20200704-21', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (22, 'eagle-22', '软件2班', 1, 1, '20200704-22', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (23, 'eagle-23', '软件2班', 1, 1, '20200704-23', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (24, 'eagle-24', '软件2班', 1, 1, '20200704-24', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (25, 'eagle-25', '软件2班', 1, 1, '20200704-25', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (26, 'eagle-26', '软件2班', 1, 1, '20200704-26', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (27, 'eagle-27', '软件2班', 1, 1, '20200704-27', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (28, 'eagle-28', '软件2班', 1, 1, '20200704-28', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (29, 'eagle-29', '软件2班', 1, 1, '20200704-29', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (30, 'eagle-30', '软件2班', 1, 1, '20200704-30', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (31, 'eagle-31', '软件2班', 1, 1, '20200704-31', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (32, 'eagle-32', '软件2班', 1, 1, '20200704-32', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (33, 'eagle-33', '软件2班', 1, 1, '20200704-33', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (34, 'eagle-34', '软件2班', 1, 1, '20200704-34', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (35, 'eagle-35', '软件2班', 1, 1, '20200704-35', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (36, 'eagle-36', '软件2班', 1, 1, '20200704-36', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (37, 'eagle-37', '软件2班', 1, 1, '20200704-37', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (38, 'eagle-38', '软件2班', 1, 1, '20200704-38', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (39, 'eagle-39', '软件2班', 1, 1, '20200704-39', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (40, 'eagle-40', '软件2班', 1, 1, '20200704-40', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (41, 'eagle-41', '软件2班', 1, 1, '20200704-41', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (42, 'eagle-42', '软件2班', 1, 1, '20200704-42', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (43, 'eagle-43', '软件2班', 1, 1, '20200704-43', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (44, 'eagle-44', '软件2班', 1, 1, '20200704-44', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (45, 'eagle-45', '软件2班', 1, 1, '20200704-45', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (46, 'eagle-46', '软件2班', 1, 1, '20200704-46', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (47, 'eagle-47', '软件2班', 1, 1, '20200704-47', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (48, 'eagle-48', '软件2班', 1, 1, '20200704-48', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (49, 'eagle-49', '软件2班', 1, 1, '20200704-49', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (50, 'eagle-50', '软件2班', 1, 1, '20200704-50', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (51, 'eagle-51', '软件2班', 1, 1, '20200704-51', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (52, 'eagle-52', '软件2班', 1, 1, '20200704-52', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (53, 'eagle-53', '软件2班', 1, 1, '20200704-53', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (54, 'eagle-54', '软件2班', 1, 1, '20200704-54', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (55, 'eagle-55', '软件2班', 1, 1, '20200704-55', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (56, 'eagle-56', '软件2班', 1, 1, '20200704-56', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (57, 'eagle-57', '软件2班', 1, 1, '20200704-57', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (58, 'eagle-58', '软件2班', 1, 1, '20200704-58', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (59, 'eagle-59', '软件2班', 1, 1, '20200704-59', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (60, 'eagle-60', '软件2班', 1, 1, '20200704-60', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (61, 'eagle-61', '软件2班', 1, 1, '20200704-61', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (62, 'eagle-62', '软件2班', 1, 1, '20200704-62', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (63, 'eagle-63', '软件2班', 1, 1, '20200704-63', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (64, 'eagle-64', '软件2班', 1, 1, '20200704-64', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (65, 'eagle-65', '软件2班', 1, 1, '20200704-65', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (66, 'eagle-66', '软件2班', 1, 1, '20200704-66', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (67, 'eagle-67', '软件2班', 1, 1, '20200704-67', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (68, 'eagle-68', '软件2班', 1, 1, '20200704-68', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (69, 'eagle-69', '软件2班', 1, 1, '20200704-69', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (70, 'eagle-70', '软件2班', 1, 1, '20200704-70', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (71, 'eagle-71', '软件2班', 1, 1, '20200704-71', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (72, 'eagle-72', '软件2班', 1, 1, '20200704-72', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (73, 'eagle-73', '软件2班', 1, 1, '20200704-73', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (74, 'eagle-74', '软件2班', 1, 1, '20200704-74', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (75, 'eagle-75', '软件2班', 1, 1, '20200704-75', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (76, 'eagle-76', '软件2班', 1, 1, '20200704-76', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (77, 'eagle-77', '软件2班', 1, 1, '20200704-77', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (78, 'eagle-78', '软件2班', 1, 1, '20200704-78', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (79, 'eagle-79', '软件2班', 1, 1, '20200704-79', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (80, 'eagle-80', '软件2班', 1, 1, '20200704-80', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (81, 'eagle-81', '软件2班', 1, 1, '20200704-81', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (82, 'eagle-82', '软件2班', 1, 1, '20200704-82', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (83, 'eagle-83', '软件2班', 1, 1, '20200704-83', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (84, 'eagle-84', '软件2班', 1, 1, '20200704-84', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:29', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (85, 'eagle-85', '软件2班', 1, 1, '20200704-85', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:30', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (86, 'eagle-86', '软件2班', 1, 1, '20200704-86', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:30', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (87, 'eagle-87', '软件2班', 1, 1, '20200704-87', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:30', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (88, 'eagle-88', '软件2班', 1, 1, '20200704-88', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:30', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (89, 'eagle-89', '软件2班', 1, 1, '20200704-89', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:31', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (90, 'eagle-90', '软件2班', 1, 1, '20200704-90', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:31', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (91, 'eagle-91', '软件2班', 1, 1, '20200704-91', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:31', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (92, 'eagle-92', '软件2班', 1, 1, '20200704-92', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:31', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (93, 'eagle-93', '软件2班', 1, 1, '20200704-93', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:32', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (94, 'eagle-94', '软件2班', 1, 1, '20200704-94', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:32', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (95, 'eagle-95', '软件2班', 1, 1, '20200704-95', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:32', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (96, 'eagle-96', '软件2班', 1, 1, '20200704-96', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:33', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (97, 'eagle-97', '软件2班', 1, 1, '20200704-97', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:33', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (98, 'eagle-98', '软件2班', 1, 1, '20200704-98', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 0, 1, '2020-07-05 18:03:33', 1, '2020-07-06 18:45:50');
INSERT INTO `orderlist` VALUES (99, 'eagle-99', '软件2班', 1, 1, '20200704-99', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 0, 1, '2020-07-05 18:03:33', 1, '2020-07-06 18:45:34');
INSERT INTO `orderlist` VALUES (100, 'eagle-100', '软件2班', 1, 1, '20200704-100', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:34', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (101, 'eagle-101', '软件2班', 1, 1, '20200704-101', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:34', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (102, 'eagle-102', '软件2班', 1, 1, '20200704-102', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:34', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (103, 'eagle-103', '软件2班', 1, 1, '20200704-103', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:35', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (104, 'eagle-104', '软件2班', 1, 1, '20200704-104', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:35', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (105, 'eagle-105', '软件2班', 1, 1, '20200704-105', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:35', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (106, 'eagle-106', '软件2班', 1, 1, '20200704-106', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:36', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (107, 'eagle-107', '软件2班', 1, 1, '20200704-107', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:36', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (108, 'eagle-108', '软件2班', 1, 1, '20200704-108', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:36', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (109, 'eagle-109', '软件2班', 1, 1, '20200704-109', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:36', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (110, 'eagle-110', '软件2班', 1, 1, '20200704-110', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:37', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (111, 'eagle-111', '软件2班', 1, 1, '20200704-111', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 0, 1, '2020-07-05 18:03:37', 1, '2020-07-06 00:11:30');
INSERT INTO `orderlist` VALUES (112, 'eagle-112', '软件2班', 1, 1, '20200704-112', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:37', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (113, 'eagle-113', '软件2班', 1, 1, '20200704-113', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 0, 1, '2020-07-05 18:03:37', 1, '2020-07-06 00:11:17');
INSERT INTO `orderlist` VALUES (114, 'eagle-114', '软件2班', 1, 1, '20200704-114', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 0, 1, '2020-07-05 18:03:38', 1, '2020-07-06 00:05:59');
INSERT INTO `orderlist` VALUES (115, 'eagle-115', '软件2班', 1, 1, '20200704-115', -6800.00, '支付宝', '2020-07-02 23:53:36', '学费', 1, 1, '2020-07-05 18:03:38', 1, '2020-07-05 18:57:28');
INSERT INTO `orderlist` VALUES (116, '更新: orderaccount', '更新: orderclass', 1, 1, '更新: ticketno', 8888.00, '更新: paytype', '2020-07-07 00:00:00', '更新: orderdes', 1, 1, '2020-07-05 23:32:50', 1, '2020-07-06 16:29:05');
INSERT INTO `orderlist` VALUES (117, '缴费/收款人:测试1', '班 级:测试1', 2, 2, '票据号:测试1', -9999.00, '收支方式:	测试1', '2020-07-05 00:00:00', '备 注:测试1', 0, 1, '2020-07-05 23:36:03', 1, '2020-07-06 00:10:54');
INSERT INTO `orderlist` VALUES (118, '收支信息', '收支信息', 5, 3, '收支信息', 9999.00, '收支信息', '2020-07-06 00:00:00', '收支信息', 1, 1, '2020-07-06 18:43:19', 1, '2020-07-06 18:53:26');
INSERT INTO `orderlist` VALUES (119, '新增收入信息', '新增收入信息', 4, 4, '新增收入信息', 999999.00, '新增收入信息', '2020-07-07 00:00:00', '新增收入信息', 1, 1, '2020-07-06 18:49:18', 1, '2020-07-06 18:49:18');
INSERT INTO `orderlist` VALUES (120, 'greatwqs-11', '软件2班', 1, 1, 'abcdef-11', 8000.00, '支付宝', '2020-07-11 00:00:00', '学费', 1, 1, '2020-07-12 00:26:36', 1, '2020-07-12 00:26:36');
INSERT INTO `orderlist` VALUES (121, 'greatwqs-12', '软件2班', 1, 1, 'abcdef-12', 8000.00, '支付宝', '2020-07-12 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (122, 'greatwqs-13', '软件2班', 1, 1, 'abcdef-13', 8000.00, '支付宝', '2020-07-13 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (123, 'greatwqs-14', '软件2班', 1, 1, 'abcdef-14', 8000.00, '支付宝', '2020-07-14 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (124, 'greatwqs-15', '软件2班', 1, 1, 'abcdef-15', 8000.00, '支付宝', '2020-07-15 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (125, 'greatwqs-16', '软件2班', 1, 1, 'abcdef-16', 8000.00, '支付宝', '2020-07-16 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (126, 'greatwqs-17', '软件2班', 1, 1, 'abcdef-17', 8000.00, '支付宝', '2020-07-17 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (127, 'greatwqs-18', '软件2班', 1, 1, 'abcdef-18', 8000.00, '支付宝', '2020-07-18 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (128, 'greatwqs-19', '软件2班', 1, 1, 'abcdef-19', 8000.00, '支付宝', '2020-07-19 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (129, 'greatwqs-20', '软件2班', 1, 1, 'abcdef-20', 8000.00, '支付宝', '2020-07-20 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (130, 'greatwqs-21', '软件2班', 1, 1, 'abcdef-21', 8000.00, '支付宝', '2020-07-21 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (131, 'greatwqs-22', '软件2班', 1, 1, 'abcdef-22', 8000.00, '支付宝', '2020-07-22 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (132, 'greatwqs-23', '软件2班', 1, 1, 'abcdef-23', 8000.00, '支付宝', '2020-07-23 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (133, 'greatwqs-24', '软件2班', 1, 1, 'abcdef-24', 8000.00, '支付宝', '2020-07-24 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (134, 'greatwqs-25', '软件2班', 1, 1, 'abcdef-25', 8000.00, '支付宝', '2020-07-25 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (135, 'greatwqs-26', '软件2班', 1, 1, 'abcdef-26', 8000.00, '支付宝', '2020-07-26 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (136, 'greatwqs-27', '软件2班', 1, 1, 'abcdef-27', 8000.00, '支付宝', '2020-07-27 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (137, 'greatwqs-28', '软件2班', 1, 1, 'abcdef-28', 8000.00, '支付宝', '2020-07-28 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (138, 'greatwqs-29', '软件2班', 1, 1, 'abcdef-29', 8000.00, '支付宝', '2020-07-29 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (139, 'greatwqs-30', '软件2班', 1, 1, 'abcdef-30', 8000.00, '支付宝', '2020-07-30 00:00:00', '学费', 1, 1, '2020-07-12 00:26:37', 1, '2020-07-12 00:26:37');
INSERT INTO `orderlist` VALUES (140, 'greatwqs-11', '软件2班', 1, 1, 'abcdef-11', 8000.00, '支付宝', '2020-07-11 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (141, 'greatwqs-12', '软件2班', 1, 1, 'abcdef-12', 8000.00, '支付宝', '2020-07-12 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (142, 'greatwqs-13', '软件2班', 1, 1, 'abcdef-13', 8000.00, '支付宝', '2020-07-13 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (143, 'greatwqs-14', '软件2班', 1, 1, 'abcdef-14', 8000.00, '支付宝', '2020-07-14 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (144, 'greatwqs-15', '软件2班', 1, 1, 'abcdef-15', 8000.00, '支付宝', '2020-07-15 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (145, 'greatwqs-16', '软件2班', 1, 1, 'abcdef-16', 8000.00, '支付宝', '2020-07-16 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (146, 'greatwqs-17', '软件2班', 1, 1, 'abcdef-17', 8000.00, '支付宝', '2020-07-17 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (147, 'greatwqs-18', '软件2班', 1, 1, 'abcdef-18', 8000.00, '支付宝', '2020-07-18 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (148, 'greatwqs-19', '软件2班', 1, 1, 'abcdef-19', 8000.00, '支付宝', '2020-07-19 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (149, 'greatwqs-20', '软件2班', 1, 1, 'abcdef-20', -1000.00, '支付宝', '2020-07-20 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (150, 'greatwqs-21', '软件2班', 1, 1, 'abcdef-21', -1000.00, '支付宝', '2020-07-21 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (151, 'greatwqs-22', '软件2班', 1, 1, 'abcdef-22', -1000.00, '支付宝', '2020-07-22 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (152, 'greatwqs-23', '软件2班', 1, 1, 'abcdef-23', -1000.00, '支付宝', '2020-07-23 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (153, 'greatwqs-24', '软件2班', 1, 1, 'abcdef-24', -1000.00, '支付宝', '2020-07-24 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (154, 'greatwqs-25', '软件2班', 1, 1, 'abcdef-25', -1000.00, '支付宝', '2020-07-25 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (155, 'greatwqs-26', '软件2班', 1, 1, 'abcdef-26', -1000.00, '支付宝', '2020-07-26 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (156, 'greatwqs-27', '软件2班', 1, 1, 'abcdef-27', -1000.00, '支付宝', '2020-07-27 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (157, 'greatwqs-28', '软件2班', 1, 1, 'abcdef-28', -1000.00, '支付宝', '2020-07-28 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (158, 'greatwqs-29', '软件2班', 1, 1, 'abcdef-29', -1000.00, '支付宝', '2020-07-29 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (159, 'greatwqs-30', '软件2班', 1, 1, 'abcdef-30', -1000.00, '支付宝', '2020-07-30 00:00:00', '备注测试数据', 1, 1, '2020-07-12 00:33:30', 1, '2020-07-12 00:33:30');
INSERT INTO `orderlist` VALUES (160, 'greatwqs-11', '软件2班', 1, 1, 'abcdef-11', 8000.00, '支付宝', '2020-07-11 00:00:00', '备注测试数据-110', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (161, 'greatwqs-12', '软件2班', 1, 1, 'abcdef-12', 8000.00, '支付宝', '2020-07-12 00:00:00', '备注测试数据-111', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (162, 'greatwqs-13', '软件2班', 1, 1, 'abcdef-13', 8000.00, '支付宝', '2020-07-13 00:00:00', '备注测试数据-112', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (163, 'greatwqs-14', '软件2班', 1, 1, 'abcdef-14', 8000.00, '支付宝', '2020-07-14 00:00:00', '备注测试数据-113', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (164, 'greatwqs-15', '软件2班', 1, 1, 'abcdef-15', 8000.00, '支付宝', '2020-07-15 00:00:00', '备注测试数据-114', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (165, 'greatwqs-16', '软件2班', 1, 1, 'abcdef-16', 8000.00, '支付宝', '2020-07-16 00:00:00', '备注测试数据-115', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (166, 'greatwqs-17', '软件2班', 1, 1, 'abcdef-17', 8000.00, '支付宝', '2020-07-17 00:00:00', '备注测试数据-116', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (167, 'greatwqs-18', '软件2班', 1, 1, 'abcdef-18', 8000.00, '支付宝', '2020-07-18 00:00:00', '备注测试数据-117', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (168, 'greatwqs-19', '软件2班', 1, 1, 'abcdef-19', 8000.00, '支付宝', '2020-07-19 00:00:00', '备注测试数据-118', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (169, 'greatwqs-20', '软件2班', 1, 1, 'abcdef-20', -1000.00, '支付宝', '2020-07-20 00:00:00', '备注测试数据-119', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (170, 'greatwqs-21', '软件2班', 1, 1, 'abcdef-21', -1000.00, '支付宝', '2020-07-21 00:00:00', '备注测试数据-120', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (171, 'greatwqs-22', '软件2班', 1, 1, 'abcdef-22', -1000.00, '支付宝', '2020-07-22 00:00:00', '备注测试数据-121', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (172, 'greatwqs-23', '软件2班', 1, 1, 'abcdef-23', -1000.00, '支付宝', '2020-07-23 00:00:00', '备注测试数据-122', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (173, 'greatwqs-24', '软件2班', 1, 1, 'abcdef-24', -1000.00, '支付宝', '2020-07-24 00:00:00', '备注测试数据-123', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (174, 'greatwqs-25', '软件2班', 1, 1, 'abcdef-25', -1000.00, '支付宝', '2020-07-25 00:00:00', '备注测试数据-124', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (175, 'greatwqs-26', '软件2班', 1, 1, 'abcdef-26', -1000.00, '支付宝', '2020-07-26 00:00:00', '备注测试数据-125', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (176, 'greatwqs-27', '软件2班', 1, 1, 'abcdef-27', -1000.00, '支付宝', '2020-07-27 00:00:00', '备注测试数据-126', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (177, 'greatwqs-28', '软件2班', 1, 1, 'abcdef-28', -1000.00, '支付宝', '2020-07-28 00:00:00', '备注测试数据-127', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
INSERT INTO `orderlist` VALUES (178, 'greatwqs-29', '软件2班', 1, 1, 'abcdef-29', -1000.00, '支付宝', '2020-07-29 00:00:00', '备注测试数据-128', 0, 1, '2020-07-12 00:41:29', 1, '2020-07-27 17:16:41');
INSERT INTO `orderlist` VALUES (179, 'greatwqs-30', '软件2班', 1, 1, 'abcdef-30', -1000.00, '支付宝', '2020-07-30 00:00:00', '备注测试数据-129', 1, 1, '2020-07-12 00:41:29', 1, '2020-07-12 00:41:29');
COMMIT;

-- ----------------------------
-- Table structure for subjectlist
-- ----------------------------
DROP TABLE IF EXISTS `subjectlist`;
CREATE TABLE `subjectlist` (
  `ID` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '项目ID',
  `School` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '校区',
  `Name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '项目名称',
  `ISValid` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否有效',
  `CreateUserId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '创建用户ID',
  `CreateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '创建时间',
  `UpdateUserId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '更新用户ID',
  `UpdateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '更新时间',
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- ----------------------------
-- Records of subjectlist
-- ----------------------------
BEGIN;
INSERT INTO `subjectlist` VALUES (1, '默认校区', '项目1', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-28 22:53:43');
INSERT INTO `subjectlist` VALUES (2, '默认校区', '项目2', 1, 1, '2020-01-01 00:00:00', 1, '2020-07-28 22:53:45');
INSERT INTO `subjectlist` VALUES (3, '默认校区', '项目3', 1, 1, '2020-07-06 18:41:30', 1, '2020-07-28 22:53:41');
INSERT INTO `subjectlist` VALUES (4, '默认校区', '新增项目4', 1, 1, '2020-07-06 18:48:53', 1, '2020-07-28 22:53:32');
INSERT INTO `subjectlist` VALUES (5, '默认校区', '新增项目5', 1, 1, '2020-07-06 18:52:02', 1, '2020-07-28 22:53:37');
COMMIT;

-- ----------------------------
-- Table structure for tickettype
-- ----------------------------
DROP TABLE IF EXISTS `tickettype`;
CREATE TABLE `tickettype` (
  `ID` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '票据类型ID',
  `Name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '票据类型名称',
  `ISValid` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否有效?',
  `CreateUserId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '创建用户ID',
  `CreateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '创建时间',
  `UpdateUserId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '更新用户ID',
  `UpdateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '更新时间',
  PRIMARY KEY (`ID`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- ----------------------------
-- Records of tickettype
-- ----------------------------
BEGIN;
INSERT INTO `tickettype` VALUES (1, '票据1', 1, 1, '2020-07-01 00:00:00', 1, '2020-07-28 22:52:53');
INSERT INTO `tickettype` VALUES (2, '票据2', 1, 1, '2020-07-01 00:00:00', 1, '2020-07-28 22:52:54');
INSERT INTO `tickettype` VALUES (3, '票据3', 1, 1, '2020-07-06 18:42:58', 1, '2020-07-28 22:52:36');
INSERT INTO `tickettype` VALUES (4, '票据4', 1, 1, '2020-07-06 18:49:00', 1, '2020-07-28 22:52:40');
INSERT INTO `tickettype` VALUES (5, '票据5', 1, 1, '2020-07-06 18:52:12', 1, '2020-07-28 22:52:45');
COMMIT;

-- ----------------------------
-- Table structure for userlist
-- ----------------------------
DROP TABLE IF EXISTS `userlist`;
CREATE TABLE `userlist` (
  `ID` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '管理员用户ID',
  `UserName` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '用户名称 (也为登录ID)',
  `Password` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '用户密码',
  `Content` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '用户描述, 备注信息',
  `ISSuperAdmin` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否是超级管理员?',
  `ISValid` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '是否有效?',
  `CreateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '创建时间',
  `UpdateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '更新时间',
  PRIMARY KEY (`ID`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of userlist
-- ----------------------------
BEGIN;
INSERT INTO `userlist` VALUES (1, 'admin', 'admin', '超级管理员', 1, 1, '2020-07-01 00:00:00', '2020-07-28 22:51:33');
INSERT INTO `userlist` VALUES (2, 'user', 'user', '普通用户', 0, 1, '2020-07-01 00:00:00', '2020-07-28 22:51:40');
INSERT INTO `userlist` VALUES (3, 'test-001', '5a9066d0-87e8-49b8-bc70-a49a2e9ba184', '测试用户', 0, 1, '2020-07-28 22:13:46', '2020-07-28 22:38:50');
INSERT INTO `userlist` VALUES (4, 'test-002', 'fbd170cd-d57c-464c-bf18-e1744794ace0', '测试用户', 0, 1, '2020-07-28 22:24:44', '2020-07-28 22:38:38');
INSERT INTO `userlist` VALUES (5, 'test-003', 'eff6bc8c-9b63-4d9d-8af1-bbb0f39d43bd', '测试用户', 0, 1, '2020-07-28 22:30:13', '2020-07-28 22:38:52');
COMMIT;

-- ----------------------------
-- Table structure for userlist_login_history
-- ----------------------------
DROP TABLE IF EXISTS `userlist_login_history`;
CREATE TABLE `userlist_login_history` (
  `ID` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '登录历史ID',
  `UserId` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '用户ID',
  `LoginIp` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '用户登录时IP',
  `LoginToken` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '用户登录令牌',
  `ExpireTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '令牌过期时间',
  `ISValid` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否有效?',
  `CreateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '创建时间',
  `UpdateTime` datetime NOT NULL DEFAULT '2020-01-01 00:00:00' COMMENT '更新时间',
  PRIMARY KEY (`ID`),
  UNIQUE KEY `Index_LoginToken` (`LoginToken`) USING BTREE,
  KEY `Index_UserId` (`UserId`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

SET FOREIGN_KEY_CHECKS = 1;
